In [22]:
import pandas as pd 
from sklearn.metrics import mean_squared_error
from sklearn.decomposition import TruncatedSVD
import matplotlib.pyplot as plt

In [23]:
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')
submission_file=pd.read_csv('sample_submission.csv')
movies=pd.read_csv('movies.csv')
links=pd.read_csv('links.csv')
imdb_data=pd.read_csv('imdb_data.csv')
genome_tags=pd.read_csv('genome_tags.csv')
genome_scores=pd.read_csv('genome_scores.csv')

In [24]:
print("The shape of the training data is : {}".format(train.shape))
print("The count of missing values in the train data is : {}".format(train.isnull().sum()))
print("The count of duplicates in the train data is : {}".format(train.duplicated().sum()))
print("Each column data type is : {}".format(train.dtypes))
train.head(3)

The shape of the training data is : (10000038, 4)
The count of missing values in the train data is : userId       0
movieId      0
rating       0
timestamp    0
dtype: int64
The count of duplicates in the train data is : 0
Each column data type is : userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

   userId  movieId  rating   timestamp
0    5163    57669     4.0  1518349992
1  106343        5     4.5  1206238739
2  146790     5459     5.0  1076215539

In [25]:
print("The shape of the test data is : {}".format(test.shape))
print("The count of missing values in the test data is : {}".format(test.isnull().sum()))
print("The count of duplicates in the test data is : {}".format(test.duplicated().sum()))
print("Each column data type is : {}".format(test.dtypes))
test.head(3)

The shape of the test data is : (5000019, 2)
The count of missing values in the test data is : userId     0
movieId    0
dtype: int64
The count of duplicates in the test data is : 0
Each column data type is : userId     int64
movieId    int64
dtype: object

   userId  movieId
0       1     2011
1       1     4144
2       1     5767

In [26]:
print("The shape of the movies data is : {}".format(movies.shape))
print("The count of missing values in the movies data is : {}".format(movies.isnull().sum()))
print("The count of duplicates in the movies data is : {}".format(movies.duplicated().sum()))
print("Each column data type is : {}".format(movies.dtypes))
movies.head(3)

The shape of the movies data is : (62423, 3)
The count of missing values in the movies data is : movieId    0
title      0
genres     0
dtype: int64
The count of duplicates in the movies data is : 0
Each column data type is : movieId     int64
title      object
genres     object
dtype: object

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [27]:
print("The shape of the links data is : {}".format(links.shape))
print("The count of missing values in the links data is : {}".format(links.isnull().sum()))
print("The count of duplicates in the links data is : {}".format(links.duplicated().sum()))
print("Each column data type is : {}".format(links.dtypes))
links.head(3)

The shape of the links data is : (62423, 3)
The count of missing values in the links data is : movieId      0
imdbId       0
tmdbId     107
dtype: int64
The count of duplicates in the links data is : 0
Each column data type is : movieId      int64
imdbId       int64
tmdbId     float64
dtype: object

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0

In [28]:
print("The shape of the imdb data is : {}".format(imdb_data.shape))
print("The count of missing values in the imdb data is : {}".format(imdb_data.isnull().sum()))
print("The count of duplicates in the imdb data is : {}".format(imdb_data.duplicated().sum()))
print("Each column data type is : {}".format(imdb_data.dtypes))
imdb_data.head(3)

The shape of the imdb data is : (27278, 6)
The count of missing values in the imdb data is : movieId              0
title_cast       10068
director          9874
runtime          12089
budget           19372
plot_keywords    11078
dtype: int64
The count of duplicates in the imdb data is : 0
Each column data type is : movieId            int64
title_cast        object
director          object
runtime          float64
budget            object
plot_keywords     object
dtype: object

,movieId,title_cast,director,runtime,budget,plot_keywords
0,1,Tom Hanks|Tim Allen|Don Rickles|Jim Varney|Wal...,John Lasseter,81.0,"$30,000,000",toy|rivalry|cowboy|cgi animation
1,2,Robin Williams|Jonathan Hyde|Kirsten Dunst|Bra...,Jonathan Hensleigh,104.0,"$65,000,000",board game|adventurer|fight|game
2,3,Walter Matthau|Jack Lemmon|Sophia Loren|Ann-Ma...,Mark Steven Johnson,101.0,"$25,000,000",boat|lake|neighbor|rivalry

In [29]:
print("The shape of the genome_tags data is : {}".format(genome_tags.shape))
print("The count of missing values in the genome_tags data data is : {}".format(genome_tags.isnull().sum()))
print("The count of duplicates in the genome_tags data data is : {}".format(genome_tags.duplicated().sum()))
print("Each column data type is : {}".format(genome_tags.dtypes))
genome_tags.head(3)

The shape of the genome_tags data is : (1128, 2)
The count of missing values in the genome_tags data data is : tagId    0
tag      0
dtype: int64
The count of duplicates in the genome_tags data data is : 0
Each column data type is : tagId     int64
tag      object
dtype: object

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century

In [30]:
 print("The shape of the genome_scores data is : {}".format(genome_scores.shape))
print("The count of missing values in the genome_scores data data is : {}".format(genome_scores.isnull().sum()))
print("The count of duplicates in the genome_scores data data is : {}".format(genome_scores.duplicated().sum()))
print("Each column data type is : {}".format(genome_scores.dtypes))
genome_scores.head(3)

The shape of the genome_scores data is : (15584448, 3)
The count of missing values in the genome_scores data data is : movieId      0
tagId        0
relevance    0
dtype: int64
The count of duplicates in the genome_scores data data is : 0
Each column data type is : movieId        int64
tagId          int64
relevance    float64
dtype: object

   movieId  tagId  relevance
0        1      1    0.02875
1        1      2    0.02375
2        1      3    0.06250

In [31]:
# Ensure correct data types
train['userId'] = train['userId'].astype(int)
train['movieId'] = train['movieId'].astype(int)
train['rating'] = train['rating'].astype(float)

In [32]:
# Check for missing values
print(train.isnull().sum())
print(test.isnull().sum())

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64
userId     0
movieId    0
dtype: int64

In [40]:
from scipy.sparse import coo_matrix
from implicit.als import AlternatingLeastSquares

In [41]:
# Create a sparse user-item interaction matrix
user_item_interaction = coo_matrix(
    (train['rating'], (train['userId'], train['movieId']))
)

In [42]:
# Initialize the ALS model
als_model = AlternatingLeastSquares(factors=20, regularization=0.1, iterations=15)

C:\Users\512GB\anaconda_new\Lib\site-packages\implicit\cpu\als.py:95: RuntimeWarning: Intel MKL BLAS is configured to use 2 threads. It is highly recommended to disable its internal threadpool by setting the environment variable 'MKL_NUM_THREADS=1' or by callng 'threadpoolctl.threadpool_limits(1, "blas")'. Having MKL use a threadpool can lead to severe performance issues
  check_blas_config()

In [43]:
# Fit the model
als_model.fit(user_item_interaction.T)  # Transpose to fit the mode

C:\Users\512GB\anaconda_new\Lib\site-packages\implicit\utils.py:164: ParameterWarning: Method expects CSR input, and was passed coo_matrix instead. Converting to CSR took 0.12666034698486328 seconds
  warnings.warn(

  0%|          | 0/15 [00:00<?, ?it/s]

In [44]:
# Predict function
def predict_rating(user_id, movie_id):
    try:
        user_factors = als_model.user_factors[user_id]
        item_factors = als_model.item_factors[movie_id]
        return np.dot(user_factors, item_factors)
    except IndexError:
        return np.nan  # Return NaN if indices are out of bounds

In [45]:
# Add predicted ratings to test data
test['predicted_rating'] = test.apply(
    lambda row: predict_rating(row['userId'], row['movieId']), axis=1
)

# Evaluate the model if test data includes actual ratings
if 'rating' in test.columns:
    test = test.dropna(subset=['predicted_rating'])
    rmse = np.sqrt(mean_squared_error(test['rating'], test['predicted_rating']))
    print(f'RMSE: {rmse}')

In [46]:
# Prepare the submission file
submission = test[['userId', 'movieId', 'predicted_rating']].rename(columns={'predicted_rating': 'rating'})
submission.to_csv('submission.csv', index=False)
print("Submission file created successfully!")

Submission file created successfully!

In [47]:
submission

        userId  movieId    rating
0            1     2011 -0.004073
1            1     4144 -0.073501
2            1     5767 -0.013148
3            1     6711  0.000000
4            1     7318  0.135175
...        ...      ...       ...
499995   16687      432  0.000000
499996   16687      434  0.000000
499997   16687      509  0.000000
499998   16687      592  0.000000
499999   16687      627  0.000000

[500000 rows x 3 columns]

In [48]:
submission_file

                  Id  rating
0             1_2011     1.0
1             1_4144     1.0
2             1_5767     1.0
3             1_6711     1.0
4             1_7318     1.0
...              ...     ...
5000014  162541_4079     1.0
5000015  162541_4467     1.0
5000016  162541_4980     1.0
5000017  162541_5689     1.0
5000018  162541_7153     1.0

[5000019 rows x 2 columns]